testing/silent_conn/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice">
    <!--clients define where tsung is executed-->
    <clients>
        <client host="localhost" use_controller_vm="true"/>
    </clients>
    <!--servers define the target server-->
    <servers>
        <server host="127.0.0.1" port="8192" type="tcp"/>
    </servers>
    <!--define the stress load-->
    <load>
        <arrivalphase phase="1" duration="1" unit="minute">
            <users maxnumber="200" arrivalrate="10" unit="second"/>
        </arrivalphase>
    </load>
    <!--define scenario options-->
    <options>
        <option name="global_number" value="200"/>
    </options>
    <!--define testing scenarios-->
    <sessions>
        <session name="open-ws-conn" probability="100" type="ts_websocket">
            <!--connect websocket-->
            <request>
                <websocket type="connect" path="/wsc"/>
            </request>
            <!--wait for 10 user connected-->
            <thinktime value="wait_global"/>
            <!--wait for more 60 seconds-->
            <thinktime value="30"/>
            <!--close websocket-->
            <request>
                <websocket type="close"/>
            </request>
        </session>
    </sessions>
</tsung>